class CmdManager:
    """
    В cmd_string содержится строка-команда, нужно рассмотреть первые 3 символа, запустить нужную команду
    в нее нужно передать уже преобразованную строку.
    Преобразование строки:
    1. Если в ней не содержится символ | (вертекальная черта), то нужно просто провести разделение по пробелам, в итоге
    должен получиться массив
    Пример: PUT var1 INT +50 ---> [var1; INT; +50]
    2. Если в ней содержится символ |, то нужно разделить сначала по этому символу, а потом уже по пробелу внутри
    строк, в итоге должен получиться массив массивов.
    Пример: CMD ADD_ZZ_Z var1 | var2 var3 - [[ADD_ZZ_Z; var1]; [var2; var3]]
    Желательно также чтобы двойные пробелы в строке не на что не влияли
    """
    def process_cmd(self, cmd_string, var_stack):
        pass
